Homework/HW7/baileyHW7.tex
% Created 2020-04-03 Fri 11:43
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{amsthm}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{graphicx}
\usepackage{fancyhdr}
\pagestyle{fancy}
\fancyhf{}
\rhead{Homework 7, Math 532}
\lhead{Jake Bailey}
\rfoot{Page \thepage}
\newtheorem{definition}{Definition}[section]
\author{Jacob Bailey}
\date{\today}
\title{Homework Set 7}
\hypersetup{
 pdfauthor={Jacob Bailey},
 pdftitle={Homework Set 7},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.3.6)}, 
 pdflang={English}}
\begin{document}

\maketitle
\section{Problem 1}
\label{sec:org82952be}
Let \(f: X\rightarrow Y\); let \(Y\) be compact Hausdorff. Then, \(f\) is continuous
if and only if the graph of \(f\), \(G_f = \{ x\times f(x)\ |\ x\in X\}\) is closed
in \(X\times Y\). [\textit{Hint:} If \(G_f\) is closed and \(V\) is a neighborhood of
\(f(x_0)\) then the intersection of \(G_f\) and \(X\times (Y\setminus V)\) is closed.]
(You may assume the results of Exercise 7 on page 171). 

\begin{proof}
Two directions, first: If \(f\) is continuous, then the graph of \(f\), \(G_f\), is
closed in \(X\times Y\). Let \(f\) be continuous. Since \(f\) is continuous and \(Y\)
compact, \(f\) carries closed sets to closed sets. Thus, the set \(Y = \{f(x)\ |\
x\in X\}\) is closed only if \(X\) is closed, which it must be, and the graph
itself is closed in the product topology. 

Next: If the graph of \(f\), \(G_f\), is closed in \(X\times Y\), then \(f\) is
continuous. We take the "hint" here, and note that since \(G_f\) is closed, \(A =
G_f\cap X\times (Y\setminus V)\) is also closed, where \(V\) is a neighborhood of
\(f(x_0)\). We also have, by exercise 7, that the projection \(\pi_1: X\times
Y\rightarrow X\) is a closed map.

\(A\) is the complement of \(V\) and is closed, thus \(V\) is open. Further, since the
projection map is a closed map, we know that the projection of \(A\) is also
closed. Finally, since the projection of \(A\) is closed, its complement (a
neighborhood in \(X\) of \(x_0\)) is open. The preimage under \(f\) of an open set is
open, and thus \(f\) is continuous. 
\end{proof}

\section{Problem 2}
\label{sec:org4d80cc9}
Let \((X,d)\) be a metric space, and let \(A\subseteq X\) be nonempty. 

a) Show that \(d(x,A) = 0\) if and only if \(x \in \overline{A}\). 
\begin{proof}
If \(d(x,A) = 0\), then either \(x\) is in \(A\) or \(x\) is a limit point of \(A\). \(x
\in \overline{A}\). 

If \(x \in \overline{A}\), then either \(x\) is in \(A\), and thus \(d(x,A) = 0\), or
\(x\) is a limit point of \(A\), and similarly, \(d(x,A) = 0\). 
\end{proof}

b) Show that if \(A\) is compact, \(d(x,A) = d(x,a)\) for some \(a \in A\). 
\begin{proof}
This is simply the definition of the distance to a set. \(d(x,A) =
\text{inf}_{a\in A} d(x,a)\). 
\end{proof}

c) Define the \(\epsilon\)-neighborhood of \(A\) in \(X\) to be the set \(U(A,\epsilon)
= \{x\ |\ d(x,A) < \epsilon\}\). Show that \(U(A,\epsilon)\) equals the union of
the open balls \(B_d(a, \epsilon)\) for \(a\in A\). 

\begin{proof}
Assume \((X,d)\) a metric space, and \(A\subseteq X\) nonempty. Consider the set \(B
= \bigcup\limits_{a\in A} B_d(a, \epsilon)\). Choose \(x \in B\). Then, by
construction, \(d(x,a) < \epsilon\) for some \(a \in A\). Clearly, \(x\in U(A,
\epsilon)\), and \(B\subseteq U(A, \epsilon)\). 

Next, consider \(y\in U(A, \epsilon)\). By defintion, \(d(y,A) =
\text{inf}_{a\in A} d(y,a)\), so if we require \(d(y,A) < \epsilon\),
\(\exists a\in A\) such that \(d(y,a) < \epsilon\). Then, \(y \in B_d(a, \epsilon)\),
and \(y\in B\). \(U(A, \epsilon) \subseteq B\), and \(U(A, \epsilon) = B\). 
\end{proof}

d) Assume that \(A\) is compact; let \(U\) be an open set containing \(A\). Show that
some \(\epsilon\)-neighborhood of \(A\) is contained in \(U\). 
\begin{proof}

\end{proof}
e) Show that the result of (d) need not hold if \(A\) is closed but not compact. 

\section{Problem 3}
\label{sec:org897d116}
Recall that \(\mathbb{R}_k\) denotes \(\mathbb{R}\) in the \$k\$-topology. 

a) show that \([0,1]\) is not compact as a subspace of \(\mathbb{R}_k\). 

Take the collection of sets \((1/n, 2)\) for all \(n\in\mathbb{N}\), in addition to
\(\mathbb{R}\setminus K\). This collection covers the interval \([0,1]\), but
contains no finite subcollection which contains 0. \([0,1]\) is not compact.  

b) Show that \(\mathbb{R}_k\) is connected. [\textit{Hint:} \((-\infty, 0)\) and
\((0, \infty)\) inherit their usual topologies as subspaces of \(\mathbb{R}_k\).]

\begin{proof}
Similar to the proof that \(\mathbb{R}\) in the standard topology is connected, we
cannot find a separation by open sets that covers the entire space, since 0 is a
member of the space. I.e. \((-\infty, 0)\) and \((0, \infty)\) does not cover the
space, since 0 is not included in the separation. 

Let \(A = (-\infty, a)\) and \(B = (b, \infty)\). If \(a < b\), the sets \(A\) and \(B\)
are disjoint, but do not cover \(\mathbb{R}_k\). If \(a > b\), the sets cover, but
are not disjoint. If \(a = b\), the sets are disjoint, but do not cover, as they
do not contain the point \(a\). 
\end{proof}

c) Show that \(\mathbb{R}_k\) is not path connected. 

\begin{proof}
Here we offer a simple counterexample. Choose points 0 and 1. If there exists a
path between these two, then the path \(f\) is a continuous function from a
compact connected space, and hence the the image must also be compact and
connected. This is a contradiction with part a. 
\end{proof}
\section{Problem 4}
\label{sec:org7e1f2c6}
Show that a connected metric space having more than one point is uncountable. 

\begin{proof}
Let there be a bijection from \(X\) to \(\mathbb{Z}_+\), constructed from the metric
\(d\) as \(x_0 \in X\), \(f:X\rightarrow\mathbb{Z}_+\), \(f(y) = d(x_0, y)\). Then, we
can separate the image of this bijection into two open sets, those with odd and
even distances from the point \(x_0\). If \(f\) is a bijection, then these two
disjoint open sets cover \(\mathbb{Z}_+\), and thus form a separation on \(X\), a
contradiction. 
\end{proof}
\section{Problem 5}
\label{sec:org9f21811}
Let \(X\) be a compact Hausdorff space; let \(\{A_n\}\) be a countable collection of
closed sets of \(X\). Show that if each set \(A_n\) has empty interior in \(X\), then
the union \(\bigcup A_n\) has empty interior in \(X\). [\textit{Hint:} Imitate the
proof of theorem 27.7]. This is a special case of the \textit{Baire category}
\textit{theorem.}

\begin{proof}
Let \(X\) and \(A_n\) be as above, and let each \(A_n\) have empty interior. The
interior of a set is the union of all open sets contained within the given set.
Thus, each \(A_n\) contains no open sets. 

Let \(U_0\) be a nonempty open set of \(X\). It is enough to show that any such set
cannot be contained in \(A = \bigcup A_n\), i.e. \(\exists x \in U_0\) such that \(x
\not\in A\). By assumption, \(A_1\) has empty interior, so \(U_0\) is not contained
in \(A_1\), and there exists \(y_1 \in U_0\) such that \(y_1\not\in A_1\). 

Next, choose a nonempty open set \(U_1\subset U_0\), such that
\(y_1\not\in\overline{U}_1\). We know that such a set exists because \(U_0\) is open
and \(X\) is Hausdorff. 

We can continue this process, i.e. given \(U_{n-1}\) choose a point
\(y_n\in U_{n-1}\), \(y_n\not\in A_n\) and a nonempty open set \(U_n\subset U_{n-1}\),
\(y_n\not\in\overline{U}_{n-1}\). Because \(X\) is compact, this nested collection
of open sets will have nonempty intersection, i.e. \(\bigcap U_n \not =
\emptyset\). Finally, we choose \(x \in \bigcap \overline{U}_n\). We have that
\(x\in U_0\) but not in any \(A_n\), and thus not in \(A\). \(A\) has empty interior. 
\end{proof}
\end{document}
